app/views/books/index.html.erb

                <p>
                  <%= link_to book_favorite_path(book.id, book.favorites.find_by(user_id: current_user.id)), method: :delete do %>
                    ♥<%= book.favorites.count %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 3], ["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

                  <%= link_to book_favorites_path(book), method: :past do %>
                    ♡<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

            <td>
              <p>コメント数：<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]