app/views/books/index.html.erb

            <td>
              <p>コメント数：<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]