app/views/books/show.html.erb

          <td><%= @book.body %></td>
          <td><%= link_to "コメント数：#{@book.book_comments.count}", book_path(@book) %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]