app/views/books/show.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 3], ["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
              <p>
                <%= link_to book_favorite_path(@book, @book.favorites.find_by(user_id: current_user.id)), method: :delete do %>
                  ♥<%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
                <%= link_to book_favorites_path(@book), method: :past do %>
                  ♡<%= @book.favorites.count %>

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
          <td>
            <p>コメント数：<%= @book.book_comments.count %></p>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
    <div class="comment">
      <% @book.book_comments.each do |book_comment| %>