app/controllers/books_controller.rb

  def index
    @books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def create
    @book_new = Book.new(book_params)
    @book_new.user_id = current_user.id
    if @book_new.save
      redirect_to book_path(@book_new), notice: 'You have created book successfully'
    else
      @books = Book.all.order(created_at: :desc)
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "oo"], ["body", "oo"], ["user_id", 2], ["created_at", "2021-03-04 08:13:24.066119"], ["updated_at", "2021-03-04 08:13:24.066119"]]
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC